1. Create table

In [1]:
import sqlite3 as sq

In [2]:
con=sq.connect('ESM.db')

In [3]:
table="Create table if not exists employee(eid int primary key,ename text NOT NULL,dept text ,basic int,branch text)"

In [4]:
cur=con.cursor()

In [5]:
cur.execute(table)

In [6]:
con.commit()

2. Insert 5 Records directly, 5 records using tuple and 5 records using taking input from user

In [7]:
insert1="insert into employee values(101,'OM','IT',25000,'Surat'),(102,'SAI','Account',20000,'Bardoli'),(103,'RAM','HR',15000,'Surat'),(104,'RADHA','Inventory',25000,'Baben'),(105,'Krishna','IT',35000,'Mumbai')"

In [8]:
cur.execute(insert1)

In [9]:
insert2="insert into employee values(?,?,?,?,?)"

In [10]:
t=((106,'Shiv','HR',50000,'Banglore'),(107,'Paravti','Inventory',40000,'Delhi'),
   (108,'Gopi','Account',30000,'Vadodara'),(109,'Anil','IT',60000,'Mumbai'),
   (110,'Lakhsmi','Inventory',20000,'Surat'))

In [11]:
cur.executemany(insert2,t)

In [12]:
insert3="insert into employee values(?,?,?,?,?)"

In [13]:
l=[]

In [14]:
for i in range(5):
    no=int(input("Enter id :"))
    name=input("Enter Name :")
    dept=input("Enter Department :")
    salary=int(input("Enter Salary:"))
    branch=input("Enter Branch :")
    t2=(no,name,dept,salary,branch)
    l.append(t2)

Enter id :111
Enter Name :Jinal
Enter Department :HR
Enter Salary:70000
Enter Branch :Surat
Enter id :112
Enter Name :Prathana
Enter Department :Account
Enter Salary:30000
Enter Branch :Valsad
Enter id :113
Enter Name :Neti
Enter Department :HR
Enter Salary:90000
Enter Branch :Kolkata
Enter id :114
Enter Name :Prapti
Enter Department :IT
Enter Salary:70000
Enter Branch :Mumbai
Enter id :115
Enter Name :Nayan
Enter Department :Inventory
Enter Salary:50000
Enter Branch :Surat

In [16]:
cur.executemany(insert3,l)

In [17]:
con.commit()

3. Update records who are from "Surat" branch with increment in salary 10%.

In [18]:
upd="Update employee set basic=basic+(basic*10/100) where branch='Surat'"

In [19]:
cur.execute(upd)

In [20]:
con.commit()


4. Print All records.

In [21]:
sel="select * from employee"

In [22]:
cur.execute(sel)

In [23]:
import pandas as pd

In [24]:
pd.DataFrame(cur.fetchall())

      0         1          2      3         4
0   101        OM         IT  27500     Surat
1   102       SAI    Account  20000   Bardoli
2   103       RAM         HR  16500     Surat
3   104     RADHA  Inventory  25000     Baben
4   105   Krishna         IT  35000    Mumbai
5   106      Shiv         HR  50000  Banglore
6   107   Paravti  Inventory  40000     Delhi
7   108      Gopi    Account  30000  Vadodara
8   109      Anil         IT  60000    Mumbai
9   110   Lakhsmi  Inventory  22000     Surat
10  111     Jinal         HR  77000     Surat
11  112  Prathana    Account  30000    Valsad
12  113      Neti         HR  90000   Kolkata
13  114    Prapti         IT  70000    Mumbai
14  115     Nayan  Inventory  55000     Surat

5. Print records where dept is "HR" and "IT".

In [25]:
sel1="select * from employee where  dept IN('HR','IT')"

In [26]:
cur.execute(sel1)

In [27]:
pd.DataFrame(cur.fetchall())

     0        1   2      3         4
0  101       OM  IT  27500     Surat
1  103      RAM  HR  16500     Surat
2  105  Krishna  IT  35000    Mumbai
3  106     Shiv  HR  50000  Banglore
4  109     Anil  IT  60000    Mumbai
5  111    Jinal  HR  77000     Surat
6  113     Neti  HR  90000   Kolkata
7  114   Prapti  IT  70000    Mumbai

6. Print records in sorting order of department.

In [28]:
sel2="select * from employee order by dept"

In [29]:
cur.execute(sel2)

In [30]:
pd.DataFrame(cur.fetchall())

      0         1          2      3         4
0   102       SAI    Account  20000   Bardoli
1   108      Gopi    Account  30000  Vadodara
2   112  Prathana    Account  30000    Valsad
3   103       RAM         HR  16500     Surat
4   106      Shiv         HR  50000  Banglore
5   111     Jinal         HR  77000     Surat
6   113      Neti         HR  90000   Kolkata
7   101        OM         IT  27500     Surat
8   105   Krishna         IT  35000    Mumbai
9   109      Anil         IT  60000    Mumbai
10  114    Prapti         IT  70000    Mumbai
11  104     RADHA  Inventory  25000     Baben
12  107   Paravti  Inventory  40000     Delhi
13  110   Lakhsmi  Inventory  22000     Surat
14  115     Nayan  Inventory  55000     Surat


7. Print records where basic is >6000.

In [31]:
sel3="select * from employee where basic>6000"

In [32]:
cur.execute(sel3)

In [33]:
pd.DataFrame(cur.fetchall())

      0         1          2      3         4
0   101        OM         IT  27500     Surat
1   102       SAI    Account  20000   Bardoli
2   103       RAM         HR  16500     Surat
3   104     RADHA  Inventory  25000     Baben
4   105   Krishna         IT  35000    Mumbai
5   106      Shiv         HR  50000  Banglore
6   107   Paravti  Inventory  40000     Delhi
7   108      Gopi    Account  30000  Vadodara
8   109      Anil         IT  60000    Mumbai
9   110   Lakhsmi  Inventory  22000     Surat
10  111     Jinal         HR  77000     Surat
11  112  Prathana    Account  30000    Valsad
12  113      Neti         HR  90000   Kolkata
13  114    Prapti         IT  70000    Mumbai
14  115     Nayan  Inventory  55000     Surat

In [34]:
con.commit()

8. Print records whrere employee name second character is "r".

In [35]:
sl4="select * from employee where ename LIKE '_r%'"

In [36]:
cur.execute(sl4)

In [37]:
pd.DataFrame(cur.fetchall())

     0         1        2      3       4
0  105   Krishna       IT  35000  Mumbai
1  112  Prathana  Account  30000  Valsad
2  114    Prapti       IT  70000  Mumbai

In [38]:
con.commit()

9. Grouping record of employee who are from "Account" and "Inventory".

In [39]:
s6="select dept,count(*) from employee group by dept having dept IN('Account','Inventory') "

In [40]:
cur.execute(s6)

In [41]:
pd.DataFrame(cur.fetchall())

           0  1
0    Account  3
1  Inventory  4

In [42]:
con.commit()

10. Print all records based on branch name in descending order.

In [43]:
s7="select * from employee order by branch DESC"

In [44]:
cur.execute(s7)

In [45]:
pd.DataFrame(cur.fetchall())

      0         1          2      3         4
0   112  Prathana    Account  30000    Valsad
1   108      Gopi    Account  30000  Vadodara
2   101        OM         IT  27500     Surat
3   103       RAM         HR  16500     Surat
4   110   Lakhsmi  Inventory  22000     Surat
5   111     Jinal         HR  77000     Surat
6   115     Nayan  Inventory  55000     Surat
7   105   Krishna         IT  35000    Mumbai
8   109      Anil         IT  60000    Mumbai
9   114    Prapti         IT  70000    Mumbai
10  113      Neti         HR  90000   Kolkata
11  107   Paravti  Inventory  40000     Delhi
12  102       SAI    Account  20000   Bardoli
13  106      Shiv         HR  50000  Banglore
14  104     RADHA  Inventory  25000     Baben

In [46]:
con.commit()

In [47]:
con.close()